[{"id": 13, "Source_Lang": "en", "Target_Lang": "fr", "Source": "The cat is orange.", "Target": "Le chat est orange."}, {"id": 14, "Source_Lang": "en", "Target_Lang": "fr", "Source": "Or how about this? I’ll just go with suddenly waking up one day with special powers—telepathy or psychokinesis or the like. It turns out there are a bunch of other people with special powers. Naturally, there are organizations recruiting such people. Members of a heroic organization come for me and I end up joining them in their battle against evil espers seeking world domination.", "Target": "Ou que dites-vous de ça ? J'imagine que l'on se réveille un jour avec des pouvoirs spéciaux - télépathie, psychokinésie ou autre. Il s'avère qu'il y a un tas d'autres personnes avec des pouvoirs spéciaux. Naturellement, il existe des organisations qui recrutent de telles personnes. Les membres d'une organisation héroïque viennent me chercher et je finis par les rejoindre dans leur combat contre des espers maléfiques qui cherchent à dominer le monde."}, {"id": 15, "Source_Lang": "en", "Target_Lang": "fr", "Source": "A mysterious transfer student suddenly arrives in my class one day. That student turns out to actually be an alien or time traveler or something along those lines with unknown powers. Then, the student happens to be fighting against some evil gang and I just happen to get caught up in that fight. The other student is the main one doing the fighting. I’m just a sidekick. Hey, that sounds cool. Damn, I’m smart.", "Target": "Un jour, un mystérieux étudiant transféré arrive soudainement dans ma classe. Cet étudiant s'avère être un extraterrestre, un voyageur du temps ou quelque chose de ce genre avec des pouvoirs inconnus. Il se trouve que l'étudiant se bat contre un gang maléfique et que je me retrouve pris dans ce combat. L'autre étudiant est celui qui se bat le plus. Je suis juste un acolyte. Hé, ça a l'air cool. Bon sang, je suis si intelligent."}, {"id": 16, "Source_Lang": "en", "Target_Lang": "fr", "Source": "Wait a minute. Assuming that aliens, etc. were actually to attack, without having any particular special powers, I would have no way to do battle with them. So I did some brainstorming.", "Target": "Attendez une minute. En supposant que des extraterrestres, etcétéra, attaquent réellement, sans avoir de pouvoirs spéciaux particuliers, je n'aurais aucun moyen de leur faire face. Alors j'ai fait un peu de remue-méninges."}, {"id": 17, "Source_Lang": "en", "Target_Lang": "fr", "Source": "Saving a girl who’s been kidnapped by aliens and imprisoned within a huge, transparent pea shell. Repelling a laser-wielding time traveler trying to change history armed only with my courage and wits. Taking out evil spirits and demons with a single incantation. Engaging in psychic battles with espers from a secret organization. Those were the kinds of things I wanted to do!", "Target": "Sauver une fille qui a été kidnappée par des extraterrestres et emprisonnée dans une énorme coquille de pois transparente. Repousser un voyageur du temps armé d'un laser qui essaie de changer l'histoire, armé seulement de mon courage et de mon intelligence. Chasser les mauvais esprits et les démons d'une seule incantation. M'engager dans des combats psychiques avec des espers d'une organisation secrète. C'est le genre de choses que je voulais faire !"}, {"id": 18, "Source_Lang": "en", "Target_Lang": "fr", "Source": "I wished I could have been born into one of those worlds!", "Target": "J'aurais aimé naître dans un de ces mondes !"}, {"id": 19, "Source_Lang": "en", "Target_Lang": "fr", "Source": "Compared to the ordinary world I wake up in every morning, the worlds depicted in cartoons, monster movies, and comics have a certain charm to them.", "Target": "Comparés au monde ordinaire dans lequel je me réveille chaque matin, les univers dépeints dans les dessins animés, les films de monstres et les bandes dessinées ont un certain charme."}, {"id": 21, "Source_Lang": "en", "Target_Lang": "fr", "Source": "No, I had probably already realized the truth. I just didn’t want to admit it.", "Target": "Non, j'avais probablement déjà réalisé la vérité. Je ne voulais juste pas l'admettre."}, {"id": 22, "Source_Lang": "en", "Target_Lang": "fr", "Source": "I was a precocious child who didn’t need to see Mommy kissing Santa Claus to question the existence of an old man who only worked on Christmas. However, I wouldn’t realize that aliens, time travelers, ghosts, demons, espers, and evil organizations and the heroes that battle them in cartoons, monster movies, and comics were made up until some time later.", "Target": "J'étais un enfant précoce qui n'avait pas besoin de voir ma mère embrasser le Père Noël pour remettre en question l'existence d'un vieil homme qui ne travaille qu’un jour par an. Cependant, ce n'est que bien plus tard que j'ai réalisé que les extraterrestres, les voyageurs dans le temps, les fantômes, les démons, les espers, les organisations maléfiques et les héros qui les combattent dans les dessins animés, les films de monstres et les bandes dessinées avaient été inventés."}, {"id": 23, "Source_Lang": "en", "Target_Lang": "fr", "Source": "I knew that the Santa at the preschool Christmas pageant was just a fake. Digging into my memories, I’m pretty sure that the other kids watching our principal dressed up as Santa didn’t think he was real either.", "Target": "Je savais que le Père Noël du spectacle de l'école maternelle était un faux. En fouillant dans mes souvenirs, je suis presque sûr que les autres enfants qui regardaient notre directeur déguisé en père Noël ne pensaient pas non plus qu'il était réel."}, {"id": 24, "Source_Lang": "en", "Target_Lang": "fr", "Source": "The question of how long someone believed in Santa Claus is a worthless topic that would never come up in idle conversation. Having said that, if you’re going to ask me how much of my childhood I spent believing in an old man in a red suit, I can confidently say that I never believed in him to begin with", "Target": "La question de savoir combien de temps quelqu'un a cru au Père Noël est un sujet sans intérêt qui ne serait jamais abordé dans une conversation futile. Cela dit, si vous me demandez combien de temps de mon enfance j'ai passé à croire à un vieil homme en costume rouge, je peux vous dire en toute confiance que je n'y ai jamais cru."}, {"id": 25, "Source_Lang": "en", "Target_Lang": "fr", "Source": "PROLOGUE", "Target": "Prologue"}, {"id": 27, "Source_Lang": "en", "Target_Lang": "fr", "Source": "The cat is black.", "Target": "Le chat est noir."}, {"id": 28, "Source_Lang": "en", "Target_Lang": "fr", "Source": "It's time to see how well it works.", "Target": "Il est temps de voir si cela fonctionne bien."}, {"id": 29, "Source_Lang": "en", "Target_Lang": "fr", "Source": "\n", "Target": "Le moment est venu de savoir si certains personnages s'échappent bien, alors.. : /,²*"}, {"id": 30, "Source_Lang": "en", "Target_Lang": "fr", "Source": "The backslash doesn't seem to escape correctly, let's test it again : \\ (at the end of the sentence it's sure not to work).", "Target": "La barre oblique inversée ne semble pas s'échapper correctement, testons-la à nouveau : \\ (à la fin de la phrase, c'est sûr que ça ne marche pas)."}, {"id": 31, "Source_Lang": "en", "Target_Lang": "fr", "Source": "Deep in my heart, I wished that aliens, time travelers, ghosts, demons, evil organizations, or espers might just pop up in front of me one day.", "Target": "Au fond de moi, je souhaitais que des extraterrestres, des voyageurs dans le temps, des fantômes, des démons, des organisations maléfiques ou des espers puissent un jour surgir devant moi."}]